#include "game/a_name.h"

#include <stdio.h>

#include "game/mes.h"

#define WS_NOWINDOWS 0x01
#define WS_NODOORS 0x02
#define WS_FENCE 0x04

typedef struct WallStructure {
    /* 0000 */ unsigned int flags;
    /* 0004 */ int field_4;
    /* 0008 */ int field_8;
    /* 000C */ int field_C;
    /* 0010 */ int field_10;
    /* 0014 */ tig_art_id_t tile_art_id;
    /* 0018 */ tig_art_id_t roof_art_id;
    /* 001C */ int field_1C;
} WallStructure;

static_assert(sizeof(WallStructure) == 0x20, "wrong size");

static bool build_tile_file_name(const char* name1, const char* name2, int a3, int a4, char* fname);
static bool sub_4EB0C0(int num, int type, int flippable, char** name_ptr);
static bool sub_4EB160(const char* name, tig_art_id_t* art_id_ptr);
static bool count_tile_names();
static bool load_tile_names();
static bool load_tile_edges();
static bool sub_4EB770(char* name, int* a2, int* a3);
static bool sub_4EB7D0(const char* name, int* index_ptr);
static tig_art_id_t sub_4EB970(tig_art_id_t a, tig_art_id_t b);
static uint8_t sub_4EBAD0(tig_art_id_t aid);
static int sub_4EC160();
static bool build_facade_file_name(int num, char* fname);
static bool sub_4EC4B0();
static char* sub_4EC8F0(tig_art_id_t aid);
static int sub_4EC940(const char* fname);
static void init_wall_names();
static void sub_4ECB80(mes_file_handle_t wallproto_mes_file, char* str, int index);
