#include "game/ai.h"

#include "game/anim_private.h"
#include "game/anim.h"
#include "game/combat.h"
#include "game/critter.h"
#include "game/dialog.h"
#include "game/item.h"
#include "game/magictech.h"
#include "game/map.h"
#include "game/mt_ai.h"
#include "game/multiplayer.h"
#include "game/name.h"
#include "game/obj.h"
#include "game/object_node.h"
#include "game/object.h"
#include "game/player.h"
#include "game/proto.h"
#include "game/random.h"
#include "game/reaction.h"
#include "game/script.h"
#include "game/skill.h"
#include "game/spell.h"
#include "game/stat.h"
#include "game/tile.h"
#include "game/timeevent.h"
#include "game/ui.h"

#define CLOCKWORK_DECOY 6719

typedef union AiParams {
    struct {
        /* 0000 */ int field_0; // Percentage of NPC hit points below which NPC will flee.
        /* 0004 */ int field_4; // Number of people besides PC beyond which NPC will flee.
        /* 0008 */ int field_8; // Number of levels above NPC beyond which NPC will flee.
        /* 000C */ int field_C; // Percentage of PC hit points below which NPC will never flee.
        /* 0010 */ int field_10; // How far to flee, in tiles.
        /* 0014 */ int field_14; // The reaction level at which the NPC will not follow the PC.
        /* 0018 */ int field_18; // How far PC align is above NPC align before NPC wont follow.
        /* 001C */ int field_1C; // How far PC align is below NPC align before NPC wont follow.
        /* 0020 */ int field_20; // How many levels the NPC can be above the PC and still join.
        /* 0024 */ int field_24; // How much a non-accidental hit will lower a follower's reaction.
        /* 0028 */ int field_28; // NPC will attack if his reaction is below this.
        /* 002C */ int field_2C; // How different alignments can be before non-follower NPC attacks.
        /* 0030 */ int field_30; // Alignment of target at (or above) which the good-aligned follower NPC will not attack.
        /* 0034 */ int field_34; // Chance of throwing defensive spell (as opposed to offensive).
        /* 0038 */ int field_38; // Chance of throwing a healing spell in combat.
        /* 003C */ int field_3C; // Minimum distance in combat.
        /* 0040 */ int field_40; // The NPC can open portals if this is nonzero and cannot if it is zero.
    };
    int values[17];
} AiParams;

static_assert(sizeof(AiParams) == 0x44, "wrong size");

typedef struct Ai {
    /* 0000 */ int64_t obj;
    /* 0008 */ int64_t danger_source;
    /* 0010 */ int danger_type;
    /* 0014 */ int field_14;
    /* 0018 */ int field_18;
    /* 001C */ int field_1C;
    /* 0020 */ int64_t field_20;
    /* 0028 */ int64_t leader_obj;
    /* 0030 */ int field_30;
    /* 0034 */ int field_34;
} Ai;

static_assert(sizeof(Ai) == 0x38, "wrong size");

typedef struct S4ABF10 {
    /* 0000 */ unsigned int flags;
    /* 0004 */ S600A20_Entry* entries;
    /* 0008 */ int cnt;
    /* 0010 */ int64_t obj;
} S4ABF10;

static_assert(sizeof(S4ABF10) == 0x18, "wrong size");

static bool sub_4A8570(Ai* ai);
static void sub_4A88D0(Ai* ai, int64_t obj);
static bool sub_4A8940(Ai* ai);
static bool sub_4A8AA0(Ai* ai, int64_t obj, bool a3);
static bool sub_4A8E70(Ai* ai);
static void sub_4A92D0(Ai* ai);
static void sub_4A94C0(int64_t obj, int64_t tgt);
static void sub_4A9B80(int64_t a1, int64_t a2, int a3, int a4);
static void sub_4A9C00(int64_t a1, int64_t a2, int64_t a3, int a4, int a5, int a6);
static void sub_4A9F10(int64_t a1, int64_t a2, int64_t a3, int a4);
static void sub_4AA420(int64_t obj, int64_t a2);
static void sub_4AA620(int64_t a1, int64_t a2);
static bool sub_4AAA30(TimeEvent* timeevent);
static void sub_4AAA60(int64_t obj, AiParams* params);
static void ai_danger_source(int64_t obj, int* type_ptr, int64_t* danger_source_ptr);
static int sub_4AABE0(int64_t a1, int a2, int64_t a3, int* a4);
static bool sub_4AAF50(Ai* ai);
