#include "game/dialog.h"

#include <stdio.h>

#include "game/ai.h"
#include "game/anim.h"
#include "game/area.h"
#include "game/critter.h"
#include "game/item.h"
#include "game/magictech.h"
#include "game/mes.h"
#include "game/mp_utils.h"
#include "game/newspaper.h"
#include "game/player.h"
#include "game/quest.h"
#include "game/random.h"
#include "game/reaction.h"
#include "game/reputation.h"
#include "game/rumor.h"
#include "game/script_name.h"
#include "game/script.h"
#include "game/skill.h"
#include "game/spell.h"
#include "game/stat.h"
#include "game/tc.h"
#include "game/timeevent.h"
#include "game/ui.h"

#define THIRTY_TWO 32

typedef enum GeneratedDialog {
    GD_PC2M,
    GD_PC2F,
    GD_CLS_M2M,
    GD_CLS_M2F,
    GD_CLS_F2F,
    GD_CLS_F2M,
    GD_CLS_PC2M,
    GD_CLS_PC2F,
    GD_RCE_M2M,
    GD_RCE_M2F,
    GD_RCE_F2F,
    GD_RCE_F2M,
    GD_NPC_M2M,
    GD_NPC_M2F,
    GD_NPC_F2F,
    GD_NPC_F2M,
    GD_DUMB_PC2M,
    GD_DUMB_PC2F,
    GD_CLS_DUMB_PC2M,
    GD_CLS_DUMB_PC2F,
    GD_CLS_DUMB_M2M,
    GD_CLS_DUMB_M2F,
    GD_CLS_DUMB_F2F,
    GD_CLS_DUMB_F2M,
    GD_RCE_DUMB_M2M,
    GD_RCE_DUMB_M2F,
    GD_RCE_DUMB_F2F,
    GD_RCE_DUMB_F2M,
    GD_STO_M2M,
    GD_STO_M2F,
    GD_STO_F2F,
    GD_STO_F2M,
} GeneratedDialog;

typedef enum DialogCondition {
    DIALOG_COND_PS,
    DIALOG_COND_CH,
    DIALOG_COND_PE,
    DIALOG_COND_AL,
    DIALOG_COND_MA,
    DIALOG_COND_TA,
    DIALOG_COND_GV,
    DIALOG_COND_GF,
    DIALOG_COND_QU,
    DIALOG_COND_RE,
    DIALOG_COND_GOLD,
    DIALOG_COND_IN,
    DIALOG_COND_HA,
    DIALOG_COND_LF,
    DIALOG_COND_LC,
    DIALOG_COND_TR,
    DIALOG_COND_SK,
    DIALOG_COND_RU,
    DIALOG_COND_RQ,
    DIALOG_COND_FO,
    DIALOG_COND_LE,
    DIALOG_COND_QB,
    DIALOG_COND_ME,
    DIALOG_COND_NI,
    DIALOG_COND_QA,
    DIALOG_COND_RA,
    DIALOG_COND_PA,
    DIALOG_COND_SS,
    DIALOG_COND_WA,
    DIALOG_COND_WT,
    DIALOG_COND_PV,
    DIALOG_COND_PF,
    DIALOG_COND_NA,
    DIALOG_COND_AR,
    DIALOG_COND_RP,
    DIALOG_COND_IA,
    DIALOG_COND_SC,
    DIALOG_COND_COUNT,
} DialogCondition;

typedef enum DialogAction {
    DIALOG_ACTION_GOLD,
    DIALOG_ACTION_RE,
    DIALOG_ACTION_QU,
    DIALOG_ACTION_FL,
    DIALOG_ACTION_CO,
    DIALOG_ACTION_GV,
    DIALOG_ACTION_GF,
    DIALOG_ACTION_MM,
    DIALOG_ACTION_AL,
    DIALOG_ACTION_IN,
    DIALOG_ACTION_LF,
    DIALOG_ACTION_LC,
    DIALOG_ACTION_TR,
    DIALOG_ACTION_RU,
    DIALOG_ACTION_RQ,
    DIALOG_ACTION_JO,
    DIALOG_ACTION_WA,
    DIALOG_ACTION_LV,
    DIALOG_ACTION_SS,
    DIALOG_ACTION_SC,
    DIALOG_ACTION_SO,
    DIALOG_ACTION_UW,
    DIALOG_ACTION_PV,
    DIALOG_ACTION_PF,
    DIALOG_ACTION_XP,
    DIALOG_ACTION_NK,
    DIALOG_ACTION_RP,
    DIALOG_ACTION_NP,
    DIALOG_ACTION_CE,
    DIALOG_ACTION_FP,
    DIALOG_ACTION_SU,
    DIALOG_ACTION_OR,
    DIALOG_ACTION_II,
    DIALOG_ACTION_RI,
    DIALOG_ACTION_ET,
    DIALOG_ACTION_COUNT,
} DialogAction;

typedef struct DialogEntry {
    /* 0000 */ int num;
    /* 0004 */ char* str;
    union {
        /* 0008 */ int gender;
        /* 0008 */ char* female_str;
    } data;
    /* 000C */ int iq;
    /* 0010 */ char* conditions;
    /* 0014 */ int response_val;
    /* 0018 */ char* actions;
} DialogEntry;

static_assert(sizeof(DialogEntry) == 0x1C, "wrong size");

typedef struct Dialog {
    /* 0000 */ char path[TIG_MAX_PATH];
    /* 0104 */ int refcount;
    /* 0108 */ DateTime timestamp;
    /* 0110 */ int entries_length;
    /* 0114 */ int entries_capacity;
    /* 0118 */ DialogEntry* entries;
    /* 011C */ int field_11C;
} Dialog;

static_assert(sizeof(Dialog) == 0x120, "wrong size");

static void sub_414810(int a1, int a2, int a3, int a4, DialogEntryNode* a5);
static void sub_414E60(DialogEntryNode* a1, bool randomize);
static int sub_414F50(DialogEntryNode* a1, int* a2);
static bool sub_4150D0(DialogEntryNode* a1, char* a2);
static bool sub_415BA0(DialogEntryNode* a1, char* a2, int a3);
static int sub_4167C0(const char* str);
static bool sub_416840(DialogEntryNode* a1, bool a2);
static bool sub_416AB0(int dlg, DialogEntry* a2);
static void sub_416B00(char* dst, char* src, DialogEntryNode* a3);
static bool sub_416C10(int a1, int a2, DialogEntryNode* a3);
static void sub_417590(int a1, int* a2, int* a3);
static bool sub_4175D0(const char* path, int* index_ptr);
static void sub_417720(Dialog* dialog);
static bool sub_417860(TigFile* stream, DialogEntry* entry, int* a3);
static bool sub_417C20(TigFile* stream, char* str, int* line_ptr);
