#include "game/dialog.h"

#include <stdio.h>

#include "game/critter.h"
#include "game/newspaper.h"
#include "game/magictech.h"
#include "game/mes.h"
#include "game/timeevent.h"
#include "game/stat.h"
#include "game/skill.h"
#include "game/spell.h"
#include "game/random.h"
#include "game/rumor.h"

#define THIRTY_TWO 32

typedef struct DialogEntry {
    /* 0000 */ int field_0;
    /* 0004 */ int field_4;
    /* 0008 */ int field_8;
    /* 000C */ int field_C;
    /* 0010 */ int field_10;
    /* 0014 */ int field_14;
    /* 0018 */ int field_18;
} DialogEntry;

static_assert(sizeof(DialogEntry) == 0x1C, "wrong size");

typedef struct Dialog {
    /* 0000 */ char path[TIG_MAX_PATH];
    /* 0104 */ int refcount;
    /* 0108 */ DateTime timestamp;
    /* 0110 */ int entries_length;
    /* 0114 */ int entries_capacity;
    /* 0118 */ DialogEntry* entries;
    /* 011C */ int field_11C;
} Dialog;

static_assert(sizeof(Dialog) == 0x120, "wrong size");

static void sub_414E60(DialogEntryNode* a1, bool randomize);
static void sub_41A150(int a1, int a2, int a3, DialogEntryNode* a4);
static void sub_41A230(int a1, int a2, int a3, DialogEntryNode* a4);
static void sub_41A290(int a1, int a2, int a3, DialogEntryNode* a4);
static void sub_41A700(int a1, DialogEntryNode* a2);

// 0x5A063C
static const char* off_5A063C[] = {
    "gd_pc2m",
    "gd_pc2f",
    "gd_cls_m2m",
    "gd_cls_m2f",
    "gd_cls_f2f",
    "gd_cls_f2m",
    "gd_cls_pc2m",
    "gd_cls_pc2f",
    "gd_rce_m2m",
    "gd_rce_m2f",
    "gd_rce_f2f",
    "gd_rce_f2m",
    "gd_npc_m2m",
    "gd_npc_m2f",
    "gd_npc_f2f",
    "gd_npc_f2m",
    "gd_dumb_pc2m",
    "gd_dumb_pc2f",
    "gd_cls_dumb_pc2m",
    "gd_cls_dumb_pc2f",
    "gd_cls_dumb_m2m",
    "gd_cls_dumb_m2f",
    "gd_cls_dumb_f2f",
    "gd_cls_dumb_f2m",
    "gd_rce_dumb_m2m",
    "gd_rce_dumb_m2f",
    "gd_rce_dumb_f2f",
