#include "game/gsound.h"

#include <math.h>
#include <stdio.h>

#include "game/gamelib.h"
#include "game/mes.h"
#include "game/player.h"
#include "game/random.h"

#define TWO 2
#define TWENTY_FIVE 25

typedef struct Sound {
    /* 0000 */ bool song;
    /* 0001 */ bool loop;
    /* 0002 */ bool over;
    /* 0004 */ int frequency;
    /* 0008 */ int time_start;
    /* 000C */ int time_end;
    /* 0010 */ int balance_left;
    /* 0014 */ int balance_right;
    /* 0018 */ int volume_min;
    /* 001C */ int volume_max;
    /* 0020 */ tig_sound_handle_t sound_handle;
    /* 0024 */ char path[TIG_MAX_PATH];
} Sound;

// See 0x41BF70.
static_assert(sizeof(Sound) == 0x128, "wrong size");

typedef struct SoundScheme {
    /* 0000 */ int scheme_num;
    /* 0004 */ int scheme_idx;
    /* 0008 */ int count;
    /* 000C */ Sound sounds[TWENTY_FIVE];
} SoundScheme;

static_assert(sizeof(SoundScheme) == 0x1CF4, "wrong size");

static const char* gsound_build_sound_path(const char* name);
static void sub_41AFB0(SoundScheme* scheme);
static tig_sound_handle_t gsound_play_sfx_func(const char* path, int loops, int volume, int extra_volume, int id);
static void sub_41B3A0();
static void sub_41B3B0(tig_sound_handle_t sound_handle);
static void sub_41B420(int64_t x, int64_t y, int* volume_ptr, int* extra_volume_ptr, TigSoundPositionalSize size);
static tig_sound_handle_t gsound_play_sfx_ex(int id, int loops, int volume, int extra_volume);
static tig_sound_handle_t gsound_play_sfx_at_xy_ex(int id, int loops, int64_t x, int64_t y, int size);
static tig_sound_handle_t gsound_play_sfx_at_loc_ex(int id, int loops, int64_t location, int size);
static void sub_41BA20(int fade_duration, int index);
static void sub_41BAC0(int fade_duration);
static void sub_41BAF0();
