#include "game/light.h"

#include "game/gamelib.h"
#include "game/object.h"
#include "game/sector.h"
#include "game/sector_block_list.h"

#define SHADOWS_KEY "shadows"

typedef struct Light602E60 {
    int field_0;
    int field_4;
    int field_8;
    struct Light602E60* next;
} Light602E60;

// See 4DE7C0.
static_assert(sizeof(Light602E60) == 0x10, "wrong size");

typedef struct LightCreateInfo {
    /* 0000 */ int64_t obj;
    /* 0008 */ int64_t loc;
    /* 0010 */ int offset_x;
    /* 0014 */ int offset_y;
    /* 0018 */ tig_art_id_t art_id;
    /* 001C */ unsigned int flags;
    /* 0020 */ uint8_t r;
    /* 0021 */ uint8_t g;
    /* 0022 */ uint8_t b;
} LightCreateInfo;

static void sub_4D9310(LightCreateInfo* create_info, Light30** light_ptr);
static void sub_4D93B0(Light30* light);
static void sub_4DD150(light_handle_t light_handle, int a2);
static void sub_4DD230(light_handle_t light_handle, int a2);
static void sub_4DD320(light_handle_t light_handle, int a2, int a3, int a4, int a5);
static void sub_4DD500(Light30* light, int offset_x, int offset_y);
static void sub_4DDAB0(Light30* light, tig_art_id_t art_id);
static tig_art_id_t sub_4DDB70(Light30* light);
static void sub_4DDB80(Light30* light, uint8_t r, uint8_t g, uint8_t b);
static bool sub_4DDD90(Sector* sector);
static void shadows_changed();
static bool sub_4DDF50();
static void sub_4DE060();
static bool sub_4DE0B0(tig_art_id_t art_id, TigPaletteModifyInfo* modify_info);
static void sub_4DE200();
static void sub_4DE250();
static void light_get_rect_internal(Light30* light, TigRect* rect);
static void sub_4DE390(Light30* light);
