#include "game/map.h"

#include <stdio.h>

#include "game/anim.h"
#include "game/critter.h"
#include "game/description.h"
#include "game/effect.h"
#include "game/gamelib.h"
#include "game/gsound.h"
#include "game/jumppoint.h"
#include "game/light_scheme.h"
#include "game/light.h"
#include "game/location.h"
#include "game/magictech.h"
#include "game/mes.h"
#include "game/obj_private.h"
#include "game/object.h"
#include "game/oname.h"
#include "game/player.h"
#include "game/proto.h"
#include "game/roof.h"
#include "game/scroll.h"
#include "game/sector.h"
#include "game/skill.h"
#include "game/stat.h"
#include "game/tb.h"
#include "game/teleport.h"
#include "game/terrain.h"
#include "game/tf.h"
#include "game/tile.h"
#include "game/timeevent.h"
#include "game/townmap.h"
#include "game/ui.h"
#include "game/wall.h"
#include "game/wallcheck.h"

#define MAP_LIST_CAPACITY 200
#define MAP_NAME_LENGTH 256
#define MAP_MODULE_COUNT 17
#define SENTINEL 0xBADDBEEF

typedef bool(MapInitFunc)(GameInitInfo* init_info);
typedef void(MapResetFunc)();
typedef bool(MapModuleLoadFunc)();
typedef void(MapModuleUnloadFunc)();
typedef void(MapExitFunc)();
typedef void(MapPingFunc)(unsigned int time);
typedef void(MapUpdateViewFunc)(ViewOptions* view_options);
typedef bool(MapSaveFunc)(TigFile* stream);
typedef bool(MapLoadFunc)(GameLoadInfo* load_info);
typedef void(MapCloseFunc)();
typedef bool(MapNewFunc)(MapNewInfo* new_map_info);
typedef void(MapResizeFunc)(GameResizeInfo* resize_info);

typedef struct MapModule {
    /* 0000 */ const char* name;
    /* 0004 */ MapInitFunc* init_func;
    /* 0008 */ MapResetFunc* reset_func;
    /* 000C */ MapModuleLoadFunc* mod_load_func;
    /* 0010 */ MapModuleUnloadFunc* mod_unload_func;
    /* 0014 */ MapExitFunc* exit_func;
    /* 0018 */ MapPingFunc* ping_func;
    /* 001C */ MapUpdateViewFunc* update_view_func;
    /* 0020 */ MapSaveFunc* save_func;
    /* 0024 */ MapLoadFunc* load_func;
    /* 0028 */ MapNewFunc* new_func;
    /* 002C */ MapCloseFunc* close_func;
    /* 0030 */ MapResizeFunc* resize_func;
} MapModule;

typedef struct MapListInfo {
    char name[MAP_NAME_LENGTH];
    int64_t x;
    int64_t y;
    int worldmap;
    int area;
} MapListInfo;

// See 0x40EA90.
static_assert(sizeof(MapListInfo) == 0x118, "wrong size");

typedef struct MapProperties {
    /* 0000 */ int base_terrain_type;
    /* 0008 */ int64_t width;
    /* 0010 */ int64_t height;
} MapProperties;

static_assert(sizeof(MapProperties) == 0x18, "wrong size");

static void map_close();
static bool map_save_preprocess();
static bool map_save_objects();
static bool map_save_difs();
static bool map_save_dynamic();
static void map_load_postprocess();
static bool map_load_mobile(const char* a1, const char* a2);
static bool map_load_dynamic(const char* name);
static void map_disable_objects();
static void map_obfuscate_name(char* str);
static bool sub_411880(char** str, char* token);
static void map_apply_obj_patch(int64_t obj, char* str);

// 0x59F058
static const char* off_59F058[MAP_TYPE_COUNT] = {
    "NONE",
    "START_MAP",
    "SHOPPING_MAP",
};

// 0x59F068
static MapModule map_modules[] = {
    { "Scroll", scroll_init, scroll_reset, NULL, NULL, scroll_exit, NULL, scroll_update_view, NULL, NULL, NULL, NULL, scroll_resize },
