#include "game/mp_utils.h"

#include "game/a_name.h"
#include "game/area.h"
#include "game/critter.h"
#include "game/gsound.h"
#include "game/obj.h"
#include "game/object.h"
#include "game/player.h"
#include "game/random.h"
#include "game/sector.h"
#include "game/spell.h"
#include "game/townmap.h"
#include "game/ui.h"

typedef struct Packet29 {
    /* 0000 */ int type;
    /* 0008 */ ObjectID oid;
} Packet29;

static_assert(sizeof(Packet29) == 0x20, "wrong size");

typedef struct Packet35 {
    /* 0000 */ int type;
    /* 0008 */ ObjectID oid;
    /* 0020 */ int damage;
} Packet35;

static_assert(sizeof(Packet35) == 0x28, "wrong size");

typedef struct Packet72 {
    /* 0000 */ int type;
    /* 0008 */ ObjectID oid;
} Packet72;

static_assert(sizeof(Packet72) == 0x20, "wrong size");

typedef struct Packet85 {
    /* 0000 */ int type;
    /* 0004 */ int extra_length;
    /* 0008 */ ObjectID oid;
    /* 0020 */ int field_20;
} Packet85;

static_assert(sizeof(Packet85) == 0x28, "wrong size");

typedef struct Packet87 {
    /* 0000 */ int type;
    /* 0008 */ ObjectID field_8;
    /* 0020 */ ObjectID field_20;
    /* 0038 */ int field_38;
} Packet87;

static_assert(sizeof(Packet87) == 0x40, "wrong size");

typedef struct Packet90 {
    /* 0000 */ int type;
    /* 0008 */ ObjectID field_8;
    /* 0020 */ ObjectID field_20;
    /* 0038 */ int field_38;
} Packet90;

static_assert(sizeof(Packet90) == 0x40, "wrong size");

typedef struct Packet92 {
    /* 0000 */ int type;
    /* 0008 */ ObjectID oid;
    /* 0020 */ tig_art_id_t art_id;
} Packet92;

static_assert(sizeof(Packet92) == 0x28, "wrong size");

typedef struct Packet94 {
    /* 0000 */ int type;
    /* 0008 */ ObjectID oid;
} Packet94;

static_assert(sizeof(Packet94) == 0x20, "wrong size");

typedef struct Packet95 {
    /* 0000 */ int type;
    /* 0008 */ ObjectID oid;
} Packet95;

static_assert(sizeof(Packet95) == 0x20, "wrong size");

typedef struct Packet96 {
    /* 0000 */ int type;
    /* 0008 */ ObjectID oid;
    /* 0020 */ int field_20;
} Packet96;

static_assert(sizeof(Packet96) == 0x28, "wrong size");

typedef struct Packet99 {
    /* 0000 */ int type;
    /* 0008 */ ObjectID oid;
    /* 0020 */ int64_t location;
    /* 0028 */ int dx;
    /* 002C */ int dy;
    /* 0030 */ int field_30;
} Packet99;

static_assert(sizeof(Packet99) == 0x38, "wrong size");

typedef struct Packet100 {
    /* 0000 */ int type;
    /* 0004 */ int subtype;
    union {
        struct {
            /* 0008 */ int field_8;
            /* 000C */ int field_C;
        } a;
        struct {
            /* 0008 */ ObjectID field_8;
        } b;
        struct {
            /* 0008 */ int field_8;
            /* 0010 */ ObjectID field_10;
            /* 0028 */ ObjectID field_28;
        } c;
        struct {
            /* 0008 */ ObjectID field_8;
            /* 0020 */ ObjectID field_20;
        } s;
        struct {
            /* 0008 */ ObjectID field_8;
            /* 0020 */ int field_20;
        } x;
        struct {
            /* 0008 */ ObjectID field_8;
            /* 0020 */ ObjectID field_20;
            /* 0038 */ int field_38;
            /* 003C */ int field_3C;
        } z;
    } d;
} Packet100;

static_assert(sizeof(Packet100) == 0x40, "wrong size");

typedef struct Packet103 {
    /* 0000 */ int type;
    /* 0008 */ ObjectID oid;
    /* 0020 */ int field_20;
} Packet103;

static_assert(sizeof(Packet103) == 0x28, "wrong size");

typedef struct Packet106 {
    /* 0000 */ int type;
    /* 0004 */ int subtype;
    /* 0008 */ int field_8;
    /* 000C */ int field_C;
    /* 0010 */ ObjectID oid;
} Packet106;

static_assert(sizeof(Packet106) == 0x28, "wrong size");

typedef struct Packet107 {
    /* 0000 */ int type;
    /* 0008 */ ObjectID oid;
} Packet107;

static_assert(sizeof(Packet107) == 0x20, "wrong size");

typedef struct Packet108 {
    /* 0000 */ int type;
    /* 0008 */ int64_t field_8;
    /* 0010 */ bool field_10;
} Packet108;

static_assert(sizeof(Packet108) == 0x18, "wrong size");

typedef struct Packet109 {
    /* 0000 */ int type;
    /* 0008 */ ObjectID oid;
    /* 0020 */ int field_20;
} Packet109;

static_assert(sizeof(Packet109) == 0x28, "wrong size");

typedef struct Packet110 {
    /* 0000 */ int type;
    /* 0004 */ int map;
    /* 0008 */ int field_8;
} Packet110;

static_assert(sizeof(Packet110) == 0xC, "wrong size");

typedef struct Packet111 {
    /* 0000 */ int type;
    /* 0004 */ tig_art_id_t art_id;
} Packet111;

static_assert(sizeof(Packet111) == 0x8, "wrong size");

typedef struct Packet112 {
    /* 0000 */ int type;
    /* 0004 */ int field_4;
    /* 0008 */ int64_t field_8;
    /* 0010 */ ObjectID oid;
} Packet112;

static_assert(sizeof(Packet112) == 0x28, "wrong size");

typedef struct Packet116 {
    /* 0000 */ int type;
    /* 0004 */ int field_4;
    /* 0008 */ int field_8;
    /* 0010 */ ObjectID oid;
} Packet116;

static_assert(sizeof(Packet116) == 0x28, "wrong size");

typedef struct Packet117 {
    /* 0000 */ int type;
    /* 0008 */ ObjectID field_8;
    /* 0020 */ ObjectID field_20;
    /* 0038 */ ObjectID field_38;
} Packet117;

static_assert(sizeof(Packet117) == 0x50, "wrong size");

typedef struct Packet118 {
    /* 0000 */ int type;
    /* 0008 */ ObjectID field_8;
    /* 0020 */ ObjectID field_20;
} Packet118;

static_assert(sizeof(Packet118) == 0x38, "wrong size");

typedef struct Packet120 {
    /* 0000 */ int type;
    /* 0004 */ struct {
        int field_4;
        int field_8;
        int field_C;
    } data;
} Packet120;

static_assert(sizeof(Packet120) == 0x10, "wrong size");

typedef struct Packet121 {
    /* 0000 */ int type;
    /* 0004 */ int field_4;
    /* 0008 */ ObjectID oid;
    /* 0020 */ int field_20;
} Packet121;

static_assert(sizeof(Packet121) == 0x28, "wrong size");

typedef struct Packet122 {
    /* 0000 */ int type;
    /* 0004 */ int field_4;
    /* 0008 */ ObjectID oid;
} Packet122;

static_assert(sizeof(Packet122) == 0x20, "wrong size");

typedef struct Packet129 {
    /* 0000 */ int type;
    /* 0004 */ int field_4;
    /* 0008 */ ObjectID oid;
    /* 0020 */ int fld;
    /* 0024 */ int subtype;
    union {
        struct {
            /* 0028 */ int field_28;
        } a;
        struct {
            /* 0028 */ int field_28;
        } b;
        struct {
            /* 0028 */ int field_28;
        } c;
        struct {
            /* 0028 */ ObjectID oid;
        } d;
        struct {
            /* 0028 */ int field_28;
            /* 0030 */ ObjectID oid;
        } e;
        struct {
            /* 0028 */ int field_28;
            /* 002C */ int field_2C;
        } f;
        struct {
            /* 0028 */ int field_28;
            /* 002C */ int field_2C;
        } g;
        struct {
            /* 0028 */ tig_art_id_t art_id;
        } h;
        struct {
            /* 0028 */ int field_28;
            /* 002C */ int field_2C;
            /* 0030 */ int field_30;
        } i;
        struct {
            /* 0028 */ unsigned int flags;
        } j;
    } d;
} Packet129;

static_assert(sizeof(Packet129) == 0x48, "wrong size");

typedef struct Packet130 {
    /* 0000 */ int type;
    /* 0004 */ int field_4;
    /* 0008 */ ObjectID oid;
    /* 0020 */ int fld;
    /* 0024 */ int length;
} Packet130;

static_assert(sizeof(Packet130) == 0x28, "wrong size");

// 0x4ED510
void sub_4ED510()
{
    // TODO: Incomplete.
}

// 0x4ED630
void sub_4ED630()
{
    // TODO: Incomplete.
}

// 0x4ED6C0
bool sub_4ED6C0(int64_t obj)
{
    Packet29 pkt;

    if ((tig_net_flags & TIG_NET_CONNECTED) == 0
        || (tig_net_flags & TIG_NET_HOST) != 0) {
        return sub_463540(obj);
    }

    pkt.type = 29;
    sub_4F0640(obj, &(pkt.oid));
    tig_net_send_app_all(&pkt, sizeof(pkt));

    return false;
}

// 0x4ED720
void sub_4ED720(int64_t obj, int damage)
{
    Packet35 pkt;

    critter_fatigue_damage_set(obj, damage);

    if ((tig_net_flags & TIG_NET_CONNECTED) != 0) {
        pkt.type = 35;
        sub_4F0640(obj, &(pkt.oid));
        pkt.damage = damage;
        tig_net_send_app_all(&pkt, sizeof(pkt));
    }
}

// 0x4ED780
void sub_4ED780()
{
    // TODO: Incomplete.
}

// 0x4ED8B0
void sub_4ED8B0()
{
    // TODO: Incomplete.
}

// 0x4ED9E0
