#include "game/multiplayer.h"

#include <stdio.h>

#include "game/anim.h"
#include "game/background.h"
#include "game/combat.h"
#include "game/critter.h"
#include "game/effect.h"
#include "game/gamelib.h"
#include "game/item.h"
#include "game/magictech.h"
#include "game/map.h"
#include "game/mes.h"
#include "game/mp_utils.h"
#include "game/obj_private.h"
#include "game/object.h"
#include "game/player.h"
#include "game/skill.h"
#include "game/stat.h"
#include "game/tech.h"
#include "game/timeevent.h"
#include "game/ui.h"

#define NUM_PLAYERS 8

#define BEGIN_SENTINEL 0x4ACEBABE
#define END_SENTINEL 0xBABE01CE

typedef struct S5F0DEC {
    /* 0000 */ ObjectID oid;
    /* 0018 */ struct S5F0DEC* next;
} S5F0DEC;

static_assert(sizeof(S5F0DEC) == 0x20, "wrong size");

typedef struct S5E8AD0 {
    /* 0000 */ unsigned int flags;
    /* 0004 */ int field_4;
    /* 0008 */ ObjectID field_8;
    /* 0020 */ int field_20;
    /* 0024 */ int field_24;
    /* 0028 */ int field_28;
    /* 002C */ int field_2C;
    /* 0030 */ int field_30;
    /* 0034 */ int field_34;
    /* 0038 */ ObjectID field_38;
} S5E8AD0;

static_assert(sizeof(S5E8AD0) == 0x50, "wrong size");

typedef struct S5F0DFC {
    /* 0000 */ int field_0;
    /* 0004 */ int field_4;
    /* 0008 */ int field_8;
    /* 000C */ int field_C;
    /* 0010 */ int field_10;
    /* 0014 */ int field_14;
    /* 0018 */ int field_18;
    /* 001C */ int field_1C;
    /* 0020 */ int field_20;
    /* 0024 */ int field_24;
    /* 0028 */ int field_28;
    /* 002C */ int field_2C;
    /* 0030 */ int field_30;
    /* 0034 */ int field_34;
    /* 0038 */ int field_38;
    /* 003C */ int field_3C;
    /* 0040 */ int field_40;
    /* 0044 */ int field_44;
    /* 0048 */ int field_48;
    /* 004C */ int field_4C;
    /* 0050 */ int field_50;
    /* 0054 */ int field_54;
    /* 0058 */ int field_58;
    /* 005C */ int field_5C;
    /* 0060 */ int field_60;
    /* 0064 */ int field_64;
    /* 0068 */ int field_68;
    /* 006C */ int field_6C;
    /* 0070 */ int field_70;
    /* 0074 */ int field_74;
    /* 0078 */ int field_78;
    /* 007C */ int field_7C;
    /* 0080 */ int field_80;
    /* 0084 */ int field_84;
    /* 0088 */ int field_88;
    /* 008C */ int field_8C;
    /* 0090 */ int field_90;
    /* 0094 */ int field_94;
    /* 0098 */ int field_98;
    /* 009C */ int field_9C;
    /* 00A0 */ int field_A0;
    /* 00A4 */ int field_A4;
    /* 00A8 */ int field_A8;
    /* 00AC */ int field_AC;
    /* 00B0 */ int field_B0;
    /* 00B4 */ int field_B4;
    /* 00B8 */ int field_B8;
    /* 00BC */ int field_BC;
    /* 00C0 */ int field_C0;
    /* 00C4 */ int field_C4;
    /* 00C8 */ int field_C8;
    /* 00CC */ int field_CC;
    /* 00D0 */ int field_D0;
    /* 00D4 */ int field_D4;
    /* 00D8 */ int field_D8;
    /* 00DC */ int field_DC;
    /* 00E0 */ int field_E0;
    /* 00E4 */ int field_E4;
    /* 00E8 */ int field_E8;
    /* 00EC */ int field_EC;
    /* 00F0 */ int field_F0;
    /* 00F4 */ int field_F4;
    /* 00F8 */ int field_F8;
    /* 00FC */ int field_FC;
    /* 0100 */ int field_100;
    /* 0104 */ int field_104;
    /* 0108 */ int field_108;
    /* 010C */ int field_10C;
    /* 0110 */ int field_110;
    /* 0114 */ int field_114;
    /* 0118 */ int field_118;
    /* 011C */ int field_11C;
    /* 0120 */ int field_120;
    /* 0124 */ int field_124;
    /* 0128 */ int field_128;
    /* 012C */ int field_12C;
    /* 0130 */ int field_130;
    /* 0134 */ int field_134;
    /* 0138 */ int field_138;
    /* 013C */ int field_13C;
    /* 0140 */ int field_140;
    /* 0144 */ int field_144;
    /* 0148 */ int field_148;
    /* 014C */ int field_14C;
    /* 0150 */ int field_150;
    /* 0154 */ int field_154;
    /* 0158 */ int field_158;
    /* 015C */ int field_15C;
    /* 0160 */ int field_160;
    /* 0164 */ int field_164;
    /* 0168 */ int field_168;
    /* 016C */ int field_16C;
    /* 0170 */ int field_170;
    /* 0174 */ int field_174;
    /* 0178 */ int field_178;
    /* 017C */ int field_17C;
    /* 0180 */ int field_180;
    /* 0184 */ int field_184;
    /* 0188 */ int field_188;
    /* 018C */ int field_18C;
    /* 0190 */ int field_190;
    /* 0194 */ int field_194;
    /* 0198 */ int field_198;
    /* 019C */ int field_19C;
    /* 01A0 */ int field_1A0;
    /* 01A4 */ int field_1A4;
    /* 01A8 */ struct S5F0DFC* next;
    /* 01AC */ int field_1AC;
} S5F0DFC;

static_assert(sizeof(S5F0DFC) == 0x1B0, "wrong size");

typedef struct S5F0E1C {
    /* 0000 */ ObjectID field_0;
    /* 0018 */ ObjectID field_18;
    /* 0030 */ int field_30;
    /* 0034 */ int field_34;
    /* 0038 */ struct S5F0E1C* next;
    /* 003C */ int field_3C;
} S5F0E1C;

static_assert(sizeof(S5F0E1C) == 0x40, "wrong size");

typedef struct S5E8E08 {
    /* 0000 */ ObjectID oid;
    /* 0018 */ char field_18[2000];
    /* 07E8 */ char field_7E8[2000];
} S5E8E08;

static_assert(sizeof(S5E8E08) == 0xFB8, "wrong size");

typedef struct S5F0BC8 {
    /* 0000 */ ObjectID oid;
    /* 0018 */ int level;
    /* 001C */ int size;
} S5F0BC8;

static_assert(sizeof(S5F0BC8) == 0x20, "wrong size");

static void sub_49CB80(S5E8AD0* a1);
static bool sub_49D570(TimeEvent* timeevent);
static void multiplayer_handle_message(void* msg);
static void sub_4A1F30(int64_t obj, int64_t location, int dx, int dy);
static bool sub_4A1F60(int player, int64_t* obj_ptr);
static void sub_4A1FC0();
static bool multiplayer_validate_message(void* msg);
static void sub_4A2040(int a1);
static bool multiplayer_handle_network_event(int type, int client_id, void* data, int size);
static void sub_4A2A30();
static void sub_4A2A40(int64_t obj);
static void sub_4A2A90(int64_t obj);
static void sub_4A2AE0(int player);
static void sub_4A2CD0(S5F0DFC* a1);
static void sub_4A2E90();
static void sub_4A3030(ObjectID a1, ObjectID a2, int a3);
static S5F0E1C* sub_4A3080(ObjectID oid);
static void sub_4A30D0(ObjectID oid);
static void sub_4A3170(ObjectID oid);
static void sub_4A3660(int player);
static void sub_4A3780();
