#include "game/obj_private.h"

#include <stdio.h>

#include "game/map.h"
#include "game/object.h"
#include "game/sector.h"

#define ONE_TWO_EIGHT 128

typedef struct FindNode {
    /* 0000 */ unsigned int flags;
    /* 0004 */ int field_4;
    /* 0008 */ int64_t obj;
    /* 0010 */ struct FindNode* prev;
    /* 0014 */ struct FindNode* next;
    /* 0018 */ int64_t sector_id;
} FindNode;

// See 0x4E3BE0.
static_assert(sizeof(FindNode) == 0x20, "wrong size");

typedef struct FindSector {
    /* 0000 */ int64_t sector_id;
    /* 0008 */ FindNode* head;
    /* 000C */ int field_C;
} FindSector;

// See 0x4E3DD0.
static_assert(sizeof(FindSector) == 0x10, "wrong size");

typedef struct S603710 {
    /* 0000 */ int field_0;
    /* 0004 */ int field_4;
} S603710;

typedef struct S6036B8 {
    /* 0000 */ ObjectID field_0;
    /* 0018 */ int64_t field_18;
} S6036B8;

static_assert(sizeof(S6036B8) == 0x20, "wrong size");

typedef struct S603720 {
    uint16_t field_0;
    uint16_t field_2;
} S603720;

static_assert(sizeof(S603720) == 0x4, "wrong size");

static void sub_4E3BE0();
static void sub_4E3C60();
static void obj_find_node_allocate(FindNode** obj_find_node);
static void obj_find_node_deallocate(FindNode* obj_find_node);
static void obj_find_node_attach(FindSector *find_sector, FindNode *find_node);
static void obj_find_node_detach(FindNode *find_node);
static void sub_4E3DD0();
static bool sub_4E3E10(int64_t sector_id, int* index_ptr);
static void sub_4E3E90(int64_t sector_id, FindSector** find_sector_ptr);
static void sub_4E3F40(FindSector* find_sector);
static void sub_4E4C80(S4E4BD0* a1, int size);
static int sub_4E5640();
static void sub_4E56A0(int index);
static bool sub_4E56E0();
static void sub_4E5770(int index);
static bool sub_4E57E0(ObjectID a1, int* index_ptr);
