#ifndef ARCANUM_GAME_UI_H_
#define ARCANUM_GAME_UI_H_

#include "game/context.h"
#include "game/timeevent.h"

typedef struct John {
    int type;
    const char* str;
    int field_8;
    int field_C;
    int64_t field_10;
} John;

static_assert(sizeof(John) == 0x18, "wrong size");

// TODO: Remove forward declarations.
typedef struct Packet81 Packet81;
typedef struct DialogSerializedData DialogSerializedData;
typedef struct S4F2810 S4F2810;
typedef struct SchematicInfo SchematicInfo;

typedef void(UI_CALLBACKS_FUNC_0)();
typedef void(UI_CALLBACKS_FUNC_4)(int64_t obj);
typedef void(UI_CALLBACKS_FUNC_8)(int64_t obj);
typedef void(UI_CALLBACKS_FUNC_C)();
typedef void(UI_CALLBACKS_FUNC_10)(long long a1);
typedef void(UI_CALLBACKS_FUNC_14)(long long a1);
typedef void(UI_CALLBACKS_FUNC_18)(int64_t obj);
typedef void(UI_CALLBACKS_FUNC_1C)(int64_t obj, bool a3, int a4);
typedef void(UI_CALLBACKS_FUNC_20)(long long a1, long long a2);
typedef void(UI_CALLBACKS_FUNC_24)(int64_t a1, int64_t a2);
typedef void(UI_CALLBACKS_FUNC_28)(int64_t obj, int tech, int action);
typedef void(UI_CALLBACKS_FUNC_2C)(int64_t obj, int type);
typedef void(UI_CALLBACKS_FUNC_30)(S4F2810 *a1, int64_t obj, int a3);
typedef void(UI_CALLBACKS_FUNC_34)();
typedef void(UI_CALLBACKS_FUNC_38)(int64_t obj, int a3, int a4);
typedef void(UI_CALLBACKS_FUNC_3C)(int64_t a1, int64_t a2);
typedef void(UI_CALLBACKS_FUNC_40)(int a1, int a2);
typedef bool(UI_CALLBACKS_FUNC_44)(int64_t obj);
typedef void(UI_CALLBACKS_FUNC_48)(int64_t obj, int index);
typedef bool(UI_CALLBACKS_FUNC_4C)(int magictech);
typedef void(UI_CALLBACKS_FUNC_50)(int magictech);
typedef void(UI_CALLBACKS_FUNC_54)();
typedef void(UI_CALLBACKS_FUNC_58)(int64_t a1, int64_t a2);
typedef void(UI_CALLBACKS_FUNC_5C)();
typedef void(UI_CALLBACKS_FUNC_60)();
typedef void(UI_CALLBACKS_FUNC_64)(int a1);
typedef void(UI_CALLBACKS_FUNC_68)(int64_t a1, int64_t a2, int a3);
typedef bool(UI_CALLBACKS_FUNC_6C)(int64_t a1, int a2);
typedef void(UI_CALLBACKS_FUNC_70)();
typedef void(UI_CALLBACKS_FUNC_74)();
typedef void(UI_CALLBACKS_FUNC_78)(int64_t a1, void* a3, int a4);
typedef void(UI_CALLBACKS_FUNC_7C)(const char* a1);
typedef void(UI_CALLBACKS_FUNC_80)(John* a1);
typedef void(UI_CALLBACKS_FUNC_84)(int a1);
typedef void(UI_CALLBACKS_FUNC_88)();
typedef void(UI_CALLBACKS_FUNC_8C)(int64_t a1, int64_t a2);
typedef void(UI_CALLBACKS_FUNC_90)(int a1, int a2);
typedef void(UI_CALLBACKS_FUNC_94)(int64_t a1, int64_t a2);
typedef void(UI_CALLBACKS_FUNC_98)();
typedef void(UI_CALLBACKS_FUNC_9C)();
typedef void(UI_CALLBACKS_FUNC_A0)(int a1, bool a2);
typedef void(UI_CALLBACKS_FUNC_A4)(int a1);
typedef void(UI_CALLBACKS_FUNC_A8)(int64_t a1, int64_t a2);
typedef void(UI_CALLBACKS_FUNC_AC)(int a1, char* str);
typedef void(UI_CALLBACKS_FUNC_B0)(int64_t obj);
typedef void(UI_CALLBACKS_FUNC_B4)(int a1, int a2);
typedef void(UI_CALLBACKS_FUNC_B8)();
typedef void(UI_CALLBACKS_FUNC_BC)(int a1);
typedef void(UI_CALLBACKS_FUNC_C0)(int a1);
typedef void(UI_CALLBACKS_FUNC_C4)(int64_t a1, int a3);
typedef bool(UI_CALLBACKS_FUNC_C8)(int a1, int64_t a2, int64_t a3);
typedef bool(UI_CALLBACKS_FUNC_CC)(int a1, int64_t a2, int64_t a3);
typedef void(UI_CALLBACKS_FUNC_D0)(int64_t a1, int64_t a2);
typedef bool(UI_CALLBACKS_FUNC_D4)(Packet81* pkt);
typedef void(UI_CALLBACKS_FUNC_D8)(int64_t obj);
typedef void(UI_CALLBACKS_FUNC_DC)();
typedef void(UI_CALLBACKS_FUNC_E0)();
typedef void(UI_CALLBACKS_FUNC_E4)();
typedef void(UI_CALLBACKS_FUNC_E8)(int64_t a1, int64_t a2, int a5, int a6, int a7);
typedef void(UI_CALLBACKS_FUNC_EC)(int64_t a1, int a3);
typedef void(UI_CALLBACKS_FUNC_F0)(long long obj, int a2, int a3, int a4, int a5, int a6, const char* str);
typedef void(UI_CALLBACKS_FUNC_F4)(DialogSerializedData* serialized_data, int a2, int a3, int a4, int a5, char* buffer);
typedef void(UI_CALLBACKS_FUNC_F8)(int a1, int a2, void* a3);
typedef bool(UI_CALLBACKS_FUNC_FC)(tig_button_handle_t button_handle);
typedef void(UI_CALLBACKS_FUNC_100)();
typedef int(UI_CALLBACKS_FUNC_104)(int a1, S4F2810* a2);
typedef void(UI_CALLBACKS_FUNC_108)();
typedef bool(UI_CALLBACKS_FUNC_10C)(TimeEvent* timeevent);
typedef void(UI_CALLBACKS_FUNC_110)(int64_t a1, int64_t a2);
typedef void(UI_CALLBACKS_FUNC_114)(int a1);
typedef bool(UI_CALLBACKS_FUNC_118)();
typedef bool(UI_CALLBACKS_FUNC_11C)();
typedef bool(UI_CALLBACKS_FUNC_120)();
typedef bool(UI_CALLBACKS_FUNC_124)(const char* a1, const char* a2);
typedef void(UI_CALLBACKS_FUNC_128)(int schematic, SchematicInfo* schematic_info);
typedef int64_t(UI_CALLBACKS_FUNC_12C)();
typedef void(UI_CALLBACKS_FUNC_130)(int64_t obj);
typedef bool(UI_CALLBACKS_FUNC_134)(int64_t a1, int64_t a2, int a3);
typedef bool(UI_CALLBACKS_FUNC_138)(int64_t a1, int64_t a2, int a3);
typedef void(UI_CALLBACKS_FUNC_13C)(int64_t a1, int64_t a2, int a3);
typedef bool(UI_CALLBACKS_FUNC_140)(int64_t a1, int64_t a2, int a3);
typedef void(UI_CALLBACKS_FUNC_144)(const char* a1);
typedef void(UI_CALLBACKS_FUNC_148)(const char* a1);
typedef void(UI_CALLBACKS_FUNC_14C)(const char* a1, const char* a2);
typedef void(UI_CALLBACKS_FUNC_150)(const char* a1, const char* a2);
typedef void(UI_CALLBACKS_FUNC_154)(int a1, int a2);
typedef void(UI_CALLBACKS_FUNC_158)(const char* a1, const char* a2);
typedef void(UI_CALLBACKS_FUNC_15C)();
typedef void(UI_CALLBACKS_FUNC_160)(int64_t a1, int64_t a2);
typedef void(UI_CALLBACKS_FUNC_164)(int a1);
typedef void(UI_CALLBACKS_FUNC_168)(int a1, int a2, int a3);
typedef void(UI_CALLBACKS_FUNC_16C)(int a1, int a2, int a3);

typedef struct UiCallbacks {
    /* 0000 */ UI_CALLBACKS_FUNC_0* field_0;
    /* 0004 */ UI_CALLBACKS_FUNC_4* field_4;
    /* 0008 */ UI_CALLBACKS_FUNC_8* field_8;
    /* 000C */ UI_CALLBACKS_FUNC_C* field_C;
    /* 0010 */ UI_CALLBACKS_FUNC_10* field_10;
    /* 0014 */ UI_CALLBACKS_FUNC_14* field_14;
    /* 0018 */ UI_CALLBACKS_FUNC_18* field_18;
    /* 001C */ UI_CALLBACKS_FUNC_1C* field_1C;
    /* 0020 */ UI_CALLBACKS_FUNC_20* field_20;
    /* 0024 */ UI_CALLBACKS_FUNC_24* field_24;
    /* 0028 */ UI_CALLBACKS_FUNC_28* field_28;
    /* 002C */ UI_CALLBACKS_FUNC_2C* field_2C;
    /* 0030 */ UI_CALLBACKS_FUNC_30* field_30;
    /* 0034 */ UI_CALLBACKS_FUNC_34* field_34;
    /* 0038 */ UI_CALLBACKS_FUNC_38* field_38;
    /* 003C */ UI_CALLBACKS_FUNC_3C* field_3C;
    /* 0040 */ UI_CALLBACKS_FUNC_40* field_40;
    /* 0044 */ UI_CALLBACKS_FUNC_44* field_44;
    /* 0048 */ UI_CALLBACKS_FUNC_48* field_48;
    /* 004C */ UI_CALLBACKS_FUNC_4C* field_4C;
    /* 0050 */ UI_CALLBACKS_FUNC_50* field_50;
    /* 0054 */ UI_CALLBACKS_FUNC_54* field_54;
    /* 0058 */ UI_CALLBACKS_FUNC_58* field_58;
    /* 005C */ UI_CALLBACKS_FUNC_5C* field_5C;
    /* 0060 */ UI_CALLBACKS_FUNC_60* field_60;
    /* 0064 */ UI_CALLBACKS_FUNC_64* field_64;
    /* 0068 */ UI_CALLBACKS_FUNC_68* field_68;
    /* 006C */ UI_CALLBACKS_FUNC_6C* field_6C;
    /* 0070 */ UI_CALLBACKS_FUNC_70* field_70;
    /* 0074 */ UI_CALLBACKS_FUNC_74* field_74;
    /* 0078 */ UI_CALLBACKS_FUNC_78* field_78;
    /* 007C */ UI_CALLBACKS_FUNC_7C* field_7C;
    /* 0080 */ UI_CALLBACKS_FUNC_80* field_80;
    /* 0084 */ UI_CALLBACKS_FUNC_84* field_84;
    /* 0088 */ UI_CALLBACKS_FUNC_88* field_88;
    /* 008C */ UI_CALLBACKS_FUNC_8C* field_8C;
    /* 0090 */ UI_CALLBACKS_FUNC_90* field_90;
    /* 0094 */ UI_CALLBACKS_FUNC_94* field_94;
    /* 0098 */ UI_CALLBACKS_FUNC_98* field_98;
    /* 009C */ UI_CALLBACKS_FUNC_9C* field_9C;
    /* 00A0 */ UI_CALLBACKS_FUNC_A0* field_A0;
    /* 00A4 */ UI_CALLBACKS_FUNC_A4* field_A4;
    /* 00A8 */ UI_CALLBACKS_FUNC_A8* field_A8;
    /* 00AC */ UI_CALLBACKS_FUNC_AC* field_AC;
    /* 00B0 */ UI_CALLBACKS_FUNC_B0* field_B0;
    /* 00B4 */ UI_CALLBACKS_FUNC_B4* field_B4;
    /* 00B8 */ UI_CALLBACKS_FUNC_B8* field_B8;
    /* 00BC */ UI_CALLBACKS_FUNC_BC* field_BC;
    /* 00C0 */ UI_CALLBACKS_FUNC_C0* field_C0;
    /* 00C4 */ UI_CALLBACKS_FUNC_C4* field_C4;
    /* 00C8 */ UI_CALLBACKS_FUNC_C8* field_C8;
    /* 00CC */ UI_CALLBACKS_FUNC_CC* field_CC;
    /* 00D0 */ UI_CALLBACKS_FUNC_D0* field_D0;
    /* 00D4 */ UI_CALLBACKS_FUNC_D4* field_D4;
    /* 00D8 */ UI_CALLBACKS_FUNC_D8* field_D8;
    /* 00DC */ UI_CALLBACKS_FUNC_DC* field_DC;
    /* 00E0 */ UI_CALLBACKS_FUNC_E0* field_E0;
    /* 00E4 */ UI_CALLBACKS_FUNC_E4* field_E4;
    /* 00E8 */ UI_CALLBACKS_FUNC_E8* field_E8;
    /* 00EC */ UI_CALLBACKS_FUNC_EC* field_EC;
    /* 00F0 */ UI_CALLBACKS_FUNC_F0* field_F0;
    /* 00F4 */ UI_CALLBACKS_FUNC_F4* field_F4;
    /* 00F8 */ UI_CALLBACKS_FUNC_F8* field_F8;
    /* 00FC */ UI_CALLBACKS_FUNC_FC* field_FC;
    /* 0100 */ UI_CALLBACKS_FUNC_100* field_100;
    /* 0104 */ UI_CALLBACKS_FUNC_104* field_104;
    /* 0108 */ UI_CALLBACKS_FUNC_108* field_108;
    /* 010C */ UI_CALLBACKS_FUNC_10C* field_10C;
    /* 0110 */ UI_CALLBACKS_FUNC_110* field_110;
    /* 0114 */ UI_CALLBACKS_FUNC_114* field_114;
    /* 0118 */ UI_CALLBACKS_FUNC_118* field_118;
    /* 011C */ UI_CALLBACKS_FUNC_11C* field_11C;
    /* 0120 */ UI_CALLBACKS_FUNC_120* field_120;
    /* 0124 */ UI_CALLBACKS_FUNC_124* field_124;
    /* 0128 */ UI_CALLBACKS_FUNC_128* field_128;
    /* 012C */ UI_CALLBACKS_FUNC_12C* field_12C;
    /* 0130 */ UI_CALLBACKS_FUNC_130* field_130;
    /* 0134 */ UI_CALLBACKS_FUNC_134* field_134;
    /* 0138 */ UI_CALLBACKS_FUNC_138* field_138;
    /* 013C */ UI_CALLBACKS_FUNC_13C* field_13C;
    /* 0140 */ UI_CALLBACKS_FUNC_140* field_140;
    /* 0144 */ UI_CALLBACKS_FUNC_144* field_144;
    /* 0148 */ UI_CALLBACKS_FUNC_148* field_148;
    /* 014C */ UI_CALLBACKS_FUNC_14C* field_14C;
    /* 0150 */ UI_CALLBACKS_FUNC_150* field_150;
    /* 0154 */ UI_CALLBACKS_FUNC_154* field_154;
    /* 0158 */ UI_CALLBACKS_FUNC_158* field_158;
    /* 015C */ UI_CALLBACKS_FUNC_15C* field_15C;
    /* 0160 */ UI_CALLBACKS_FUNC_160* field_160;
    /* 0164 */ UI_CALLBACKS_FUNC_164* field_164;
    /* 0168 */ UI_CALLBACKS_FUNC_168* field_168;
    /* 016C */ UI_CALLBACKS_FUNC_16C* field_16C;
} UiCallbacks;

void ui_init(UiCallbacks* callbacks);
void ui_exit();
bool ui_timeevent_process(TimeEvent* timeevent);
void sub_4601C0();
void sub_4601D0(int64_t obj);
void sub_4601F0(int64_t obj);
void sub_460240(long long a1);
void sub_460260(long long a1);
void sub_460280(int64_t obj);
void sub_4602A0(int64_t obj, int a3, int a4);
void sub_4602D0(long long a1, long long a2);
void sub_460300(int64_t a1, int64_t a2);
void sub_460330(int64_t obj, int tech, int action);
void sub_460360(int64_t obj, int type);
void sub_460380(S4F2810 *a1, int64_t obj, int a3);
void sub_4603E0(int64_t obj, int a3, int a4);
void sub_460410(int64_t a1, int64_t a2);
void sub_460440(int a1, int a2);
int sub_460460(int64_t obj);
int sub_4604A0(int a1);
void sub_4604C0(int a1);
void sub_4604E0();
void sub_4604F0(int64_t a1, int64_t a2);
void sub_460520();
void sub_460530();
void sub_460540(int a1);
void sub_460560(int64_t a1, int64_t a2, int a3);
int sub_460590(int64_t a1, int a2);
void sub_4605C0();
void sub_4605D0();
void sub_4605E0(int64_t a1, void* a2, int a3);
void sub_460610(const char* a1);
void sub_460630(John* a1);
void sub_460650(John* a1, unsigned int milliseconds);
void sub_4606C0(int a1);
void sub_4606E0();
void sub_4606F0(int64_t a1, int64_t a2);
void sub_460720(int a1, int a2);
void sub_460740(int64_t a1, int64_t a2);
void sub_460770();
void sub_460780();
void sub_460790(int a1, int a2);
void sub_4607B0(int a1);
void sub_4607D0(int64_t a1, int64_t a2);
void sub_460800(int a1, char* str);
void sub_460820(int64_t obj);
void sub_460840(int a1, int a2);
void sub_460860();
void sub_460870(int a1);
void sub_460890(int a1);
void sub_4608B0(int64_t a1, int a2);
void sub_4608D0(int a1, int64_t a2, int64_t a3);
void sub_460900(int a1, int64_t a2, int64_t a3);
void sub_460930(int64_t a1, int64_t a2);
void sub_460960(Packet81* pkt);
void sub_460980(int64_t a1);
void sub_4609E0(int64_t a1, int64_t a2, int a5, int a6, int a7);
void sub_460A20(int64_t a1, int a3);
void sub_460A40(int64_t obj, int a3, int a4, int a5, int a6, int a7, const char* str);
void sub_460A80(DialogSerializedData* a1, int a2, int a3, int a4, int a5, char* buffer);
void sub_460AB0(int a1, int a2, void* a3);
void sub_460AD0(int a1);
void sub_460AF0();
int sub_460B00(int a1, S4F2810* a2);
void sub_460B20();
int sub_460B30(TimeEvent* timeevent);
void sub_460B50(int64_t a1, int64_t a2);
void sub_460B80(int a1);
int sub_460BA0();
int sub_460BB0();
int sub_460BC0();
int sub_460BE0(const char* a1, const char* a2);
void sub_460C00(int schematic, SchematicInfo* schematic_info);
int64_t sub_460C20();
void sub_460C30(int64_t a1);
int sub_460C50(int64_t a1, int64_t a2, int a3);
int sub_460C80(int64_t a1, int64_t a2, int a3);
void sub_460CB0(int64_t a1, int64_t a2, int a3);
int sub_460CE0(int64_t a1, int64_t a2, int a3);
void sub_460D10(const char* a1);
void sub_460D30(const char* a1);
void sub_460D50(const char* a1, const char* a2);
void sub_460D70(const char* a1, const char* a2);
void sub_460D90(int a1, int a2);
void sub_460DB0(const char* a1, const char* a2);
void sub_460DD0();
void sub_460DE0(int64_t a1, int64_t a2);
void sub_460E10(int a1);
void sub_460E30();
void sub_460E50(int a1, int a2, int a3);

#endif /* ARCANUM_GAME_UI_H_ */
