#include "tig/art.h"

#include <stdio.h>

#include "tig/color.h"
#include "tig/debug.h"
#include "tig/file.h"
#include "tig/memory.h"
#include "tig/palette.h"
#include "tig/timer.h"
#include "tig/core.h"
#include "tig/video.h"

#define MAX_PALETTES 4

typedef struct TigArtFileFrameData {
    /* 0000 */ int width;
    /* 0004 */ int height;
    /* 0008 */ int data_size;
    /* 000C */ int field_C;
    /* 0010 */ int field_10;
    /* 0014 */ int field_14;
    /* 0018 */ int field_18;
} TigArtFileFrameData;

static_assert(sizeof(TigArtFileFrameData) == 0x1C, "wrong size");

typedef struct TigArtHeader {
    /* 0000 */ int unk_0;
    /* 0004 */ int unk_4;
    /* 0008 */ int field_8;
    /* 000C */ uint32_t* palette_tbl[4];
    /* 001C */ int field_1C;
    /* 0020 */ int num_frames;
    /* 0024 */ TigArtFileFrameData* frames_tbl[8];
    /* 0044 */ int field_44[8];
    /* 0064 */ uint8_t* pixels_tbl[8];
} TigArtHeader;

static_assert(sizeof(TigArtHeader) == 0x84, "wrong size");

typedef struct TigArtCacheEntry {
    /* 0000 */ unsigned int flags;
    /* 0004 */ char path[MAX_PATH];
    /* 0108 */ timer_t time;
    /* 010C */ unsigned int art_id;
    /* 0110 */ TigArtHeader hdr;
    /* 0194 */ uint8_t field_194[4][8];
    /* 01B4 */ TigVideoBuffer** video_buffers[4][8];
    /* 0234 */ uint8_t** pixels_tbl[8];
    /* 0254 */ TigPalette field_254[4];
    /* 0264 */ size_t system_memory_usage;
    /* 0268 */ size_t video_memory_usage;
} TigArtCacheEntry;

static_assert(sizeof(TigArtCacheEntry) == 0x26C, "wrong size");

static int art_get_video_buffer(unsigned int cache_entry_index, tig_art_id_t art_id, TigVideoBuffer** video_buffer_ptr);
static int sub_505940(unsigned int art_blt_flags, unsigned int* vb_blt_flags_ptr);
static int sub_5059F0(int cache_entry_index, TigArtBlitSpec* blt);
static int art_blit(int cache_entry_index, TigArtBlitSpec* blt);
static unsigned int sub_51AA90(tig_art_id_t art_id);
static void sub_51AC20();
static int tig_art_cache_entry_compare_time(const void* a1, const void* a2);
static int tig_art_cache_entry_compare_name(const void* a1, const void* a2);
static int tig_art_build_path(unsigned int art_id, char* path);
static bool tig_art_cache_find(const char* path, int* index);
static bool sub_51B170(tig_art_id_t art_id, const char* path, int index);
static void sub_51B490(int cache_entry_index);
static void sub_51B610(unsigned int cache_entry_index);
