#include "tig/video.h"

#include <d3d.h>
#include <stdio.h>

#include "tig/art.h"
#include "tig/color.h"
#include "tig/debug.h"
#include "tig/message.h"
#include "tig/mouse.h"
#include "tig/timer.h"
#include "tig/window.h"

typedef struct TigVideoBuffer {
    /* 0000 */ unsigned int flags;
    /* 0004 */ int x;
    /* 0008 */ int y;
    /* 000C */ int width;
    /* 0010 */ int height;
    /* 0014 */ int texture_width;
    /* 0018 */ int texture_height;
    /* 001C */ int pitch;
    /* 0020 */ int background_color;
    /* 0024 */ int color_key;
    /* 0028 */ LPDIRECTDRAWSURFACE7 surface;
    /* 002C */ DDSURFACEDESC2 surface_desc;
    /* 00A8 */ union {
        void* surface_data;
        uint8_t* surface_data_8bpp;
        uint16_t* surface_data_16bpp;
        uint32_t* surface_data_32bpp;
    };
    /* 00AC */ int lock_count;
};

static_assert(sizeof(TigVideoBuffer) == 0xB0, "wrong size");

typedef struct TigVideoState {
    /* 0000 */ HINSTANCE instance;
    /* 0004 */ HWND wnd;
    /* 0008 */ LPDIRECTDRAW7 ddraw;
    /* 000C */ LPDIRECTDRAWSURFACE7 primary_surface;
    /* 0010 */ LPDIRECTDRAWSURFACE7 offscreen_surface;
    /* 0014 */ LPDIRECTDRAWSURFACE7 main_surface;
    /* 0018 */ LPDIRECTDRAWPALETTE palette;
    /* 001C */ LPDIRECT3D7 d3d;
    /* 0020 */ LPDIRECT3DDEVICE7 d3d_device;
    /* 0024 */ DDSURFACEDESC2 current_surface_desc;
    /* 00A0 */ LPDIRECTDRAWGAMMACONTROL gamma_control;
    /* 00A4 */ bool have_gamma_control;
    /* 00A8 */ DDGAMMARAMP gamma_ramp;
    // TODO: Better name.
    /* 06A8 */ DDGAMMARAMP gamma_ramp2;
};

static_assert(sizeof(TigVideoState) == 0x110C, "wrong size");

// 0x5BF3D8
static int dword_5BF3D8 = -1;

// 0x60F250
static TigVideoState tig_video_state;

// 0x60FEF8
static float tig_video_gamma;

// 0x60FEFC
static RECT tig_video_client_rect;

// 0x61030C
static int tig_video_bpp;

// 0x610310
static bool tig_video_fullscreen;

// 0x610314
static bool tig_video_double_buffered;

// 0x610318
static int dword_610318;

// 0x61031C
static bool tig_video_3d_initialized;

// 0x610320
static bool tig_video_3d_is_hardware;

// 0x610324
static bool tig_video_3d_texture_must_power_of_two;

// 0x610328
static bool tig_video_3d_texture_must_be_square;

// 0x61032C
static int tig_video_3d_extra_surface_caps;

// 0x610330
static int tig_video_3d_extra_surface_caps2;

// 0x610334
static TigVideoBuffer* tig_video_3d_viewport;

// 0x610338
static DDPIXELFORMAT tig_video_3d_pixel_format;

// 0x610388
static TigRect stru_610388;

// 0x610398
