#include "ui/intgame.h"

#include "game/gamelib.h"
#include "game/item.h"
#include "game/magictech.h"
#include "game/map.h"
#include "game/obj.h"
#include "game/object.h"
#include "game/player.h"
#include "game/spell.h"
#include "game/stat.h"
#include "game/timeevent.h"
#include "ui/compact_ui.h"
#include "ui/gameuilib.h"
#include "ui/hotkey_ui.h"
#include "ui/roller_ui.h"
#include "ui/textedit_ui.h"

typedef struct IntgameIsoWindowTypeInfo {
    /* 0000 */ TigRect rect;
    /* 0010 */ tig_window_handle_t window_handle;
} IntgameIsoWindowTypeInfo;

static_assert(sizeof(IntgameIsoWindowTypeInfo) == 0x14, "wrong size");

typedef struct S64C540 {
    /* 0000 */ int field_0;
    /* 0004 */ void* field_4;
    /* 0008 */ int field_8;
    /* 000C */ int field_C;
    /* 0010 */ int field_10;
    /* 0014 */ int field_14;
} S64C540;

static_assert(sizeof(S64C540) == 0x18, "wrong size");

static bool sub_54AB20(UiButtonInfo* button_info, unsigned int flags);
static bool sub_54ABD0(UiButtonInfo* button_info, int width, int height);
static void intgame_ammo_icon_refresh(tig_art_id_t art_id);
static void sub_54DBF0(int btn, int window_type);
static void sub_5509C0(const char* str, TigRect* rect);
static void sub_550A10(tig_window_handle_t window_handle, const char* str, TigRect* rect, tig_font_handle_t font, unsigned int flags);
static void sub_550C60(int group);
static void sub_550CD0(int group);
static bool sub_550D20();
static void sub_550D60();
static void iso_interface_window_enable(int window_type);
static void sub_551660();
static int sub_551740(int x, int y);
static void sub_5517F0();
static void sub_5518C0(int x, int y);
static void sub_551A10(int64_t obj);
static void sub_551F20();
static void sub_551F40();
static void sub_5520D0(int window_type, int a2);
