#include "ui/wmap_ui.h"

#include <stdio.h>

#include "game/ai.h"
#include "game/anim.h"
#include "game/antiteleport.h"
#include "game/area.h"
#include "game/critter.h"
#include "game/gamelib.h"
#include "game/gsound.h"
#include "game/location.h"
#include "game/magictech.h"
#include "game/map.h"
#include "game/mes.h"
#include "game/obj.h"
#include "game/path.h"
#include "game/player.h"
#include "game/sector.h"
#include "game/teleport.h"
#include "game/townmap.h"
#include "game/ui.h"
#include "ui/anim_ui.h"
#include "ui/intgame.h"
#include "ui/textedit_ui.h"
#include "ui/types.h"

typedef struct WmapCoords {
    int x;
    int y;
} WmapCoords;

static_assert(sizeof(WmapCoords) == 0x8, "wrong size");

typedef struct S5C9160 {
    // NOTE: Rare case - during initialization the value at offset 0 is art num,
    // which is replaced with interface art id (see `wmap_ui_init`).
    union {
        int num;
        tig_art_id_t art_id;
    } data;
    /* 0004 */ int width;
    /* 0008 */ int height;
    /* 000C */ tig_color_t color;
    /* 0010 */ tig_font_handle_t font;
    /* 0014 */ int field_14;
} S5C9160;

static_assert(sizeof(S5C9160) == 0x18, "wrong size");

typedef struct WmapNote {
    /* 0000 */ int id;
    /* 0004 */ int field_4;
    /* 0008 */ WmapCoords coords;
    /* 0010 */ int64_t field_10;
    /* 0018 */ TigRect field_18;
    /* 0028 */ int field_28;
    /* 002C */ char str[250];
    /* 0128 */ TigVideoBuffer* video_buffer;
    /* 012C */ int field_12C;
} WmapNote;

static_assert(sizeof(WmapNote) == 0x130, "wrong size");

typedef struct WmapTile {
    /* 0000 */ unsigned int flags;
    /* 0004 */ TigVideoBuffer* video_buffer;
    /* 0008 */ TigRect rect;
    /* 0018 */ void* field_18;
    /* 001C */ int field_1C;
} WmapTile;

static_assert(sizeof(WmapTile) == 0x20, "wrong size");

typedef struct Wmap {
    /* 0000 */ unsigned int flags;
    /* 0004 */ TigRect rect;
    /* 0014 */ TigRect field_14;
    /* 0024 */ int field_24;
    /* 0028 */ int field_28;
    /* 002C */ int field_2C;
    /* 0030 */ int field_30;
    /* 0034 */ int field_34;
    /* 0038 */ int field_38;
    /* 003C */ WmapCoords field_3C;
    /* 0044 */ int field_44;
    /* 0048 */ void(*refresh)();
    /* 004C */ void(*refresh_rect)(TigRect* rect);
    /* 0050 */ void(*field_50)(int direction, int, int, int);
    /* 0054 */ int field_54;
    /* 0058 */ int field_58;
    /* 005C */ int field_5C;
    /* 0060 */ int field_60;
    /* 0064 */ int field_64;
    /* 0068 */ char field_68[TIG_MAX_PATH];
    /* 016C */ int field_16C;
    /* 0170 */ int field_170;
    /* 0174 */ int num_tiles;
    /* 0178 */ int num_hor_tiles;
    /* 017C */ int num_vert_tiles;
    /* 0180 */ WmapTile* tiles;
    /* 0184 */ int num_loaded_tiles;
    /* 0188 */ WmapNote* notes;
    /* 018C */ int field_18C;
    /* 0190 */ int* num_notes;
    /* 0194 */ int field_194;
    /* 0198 */ int field_198;
    /* 019C */ int field_19C;
    /* 01A0 */ int field_1A0;
    /* 01A4 */ char str[260];
    /* 02A8 */ TigRect field_2A8;
    /* 02B8 */ TigVideoBuffer* video_buffer;
    /* 02BC */ void(*field_2BC)(int x, int y, WmapCoords* coords);
} Wmap;

static_assert(sizeof(Wmap) == 0x2C0, "wrong size");

typedef struct S64E048 {
    /* 0000 */ int field_0;
    /* 0004 */ int field_4;
    /* 0008 */ WmapCoords coords;
    /* 0010 */ int64_t loc;
    /* 0018 */ int field_18;
    /* 001C */ int field_1C;
} S64E048;

static_assert(sizeof(S64E048) == 0x20, "wrong size");

typedef struct S64E408 {
    /* 0000 */ S64E048 field_0[30];
    /* 03C0 */ int field_3C0;
    /* 03C4 */ int field_3C4;
    /* 03C8 */ int field_3C8;
    /* 03CC */ int field_3CC;
} S64E408;

static_assert(sizeof(S64E408) == 0x3D0, "wrong size");

static void sub_560150();
static void sub_562FE0(int a1);

// 0x5C9160
static S5C9160 stru_5C9160[8] = {
    { 142, 0, 0, 0, 0, 1 },
    { 144, 0, 0, 0, 0, 1 },
    { 141, 0, 0, 0, 0, 1 },
    { 143, 0, 0, 0, 0, 1 },
    { 204, 0, 0, 0, 0, 1 },
    { 205, 0, 0, 0, 0, 1 },
    { 206, 0, 0, 0, 0, 1 },
    { 814, 0, 0, 0, 0, 1 },
};

static void sub_560010();
static void wmap_ui_town_notes_save();
static bool wmap_ui_town_note_save(WmapNote* note, TigFile* stream);
static bool sub_560440(TigRect* rect, TigFile* stream);
static bool wmap_ui_town_note_load(WmapNote* note, TigFile* stream);
static bool sub_5606B0(TigRect* rect, TigFile* stream);
static void wmap_ui_open_internal();
static bool wmap_load_worldmap_info();
static void sub_560EE0();
static void sub_560EF0();
static bool wmap_ui_create();
static void sub_561430(int64_t location);
